artillery.yml
config:
  target: 'http://localhost:3333'
  phases:
    - duration: 10
      arrivalRate: 10
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
  processor: "./randomId.js"
scenarios:
  - flow:
    - function: "generateRandomGetId"
    - get:
        url: "/associatedVideos/{{ getId }}"