artillery.yml
config:
  target: 'http://localhost:3333'
  http:
    pool: 10
  phases:
    - duration: 60
      arrivalRate: 1
    - duration: 60
      arrivalRate: 10
    - duration: 60
      arrivalRate: 10
      rampTo: 100
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
  processor: "./randomId.js"
scenarios:
  - name: "get requests with random id between 9999000 and 10000000"
  - weight: 5
  - flow:
    - function: "generateRandomGetId"
    - get:
        url: "/associatedVideos/{{getId}}"
  - name: "post request with incrementing id"
  - weight: 2
  - flow:
    - function: "generateRandomPostId"
    - post:
        url: "/associatedVideos/{{postId}}"
        json:
          id: "{{postId}}"
          name: "test"
          associatedVideoTitle1: "test"
          associatedVideoTitle2: "test"
          associatedVideoTitle3: "test"
          associatedVideoTitle4: "test"
          associatedVideoTitle5: "test"
          associatedVideoLink1: "test"
          associatedVideoLink2: "test"
          associatedVideoLink3: "test"
          associatedVideoLink4: "test"
          associatedVideoLink5: "test"